#+title: K8s infra

Initial setup for a complete K8s setup.

#+begin_src bash :exports both :results raw
echo -n "[[$(make ENV=prod kubectl-ingress-url)][Public IP of the nginx ingress via NodePort]]"
#+end_src

#+RESULTS:
[[http://104.238.156.217:32080][Public IP of the nginx ingress via NodePort]]


* Overview
** OpenTofu
Manages clusters via Vultr provider and works as a Source Of Truth for shared configuration between Makefile, Helm charts and itself.

** Helmfile
Manages the K8s resources

* Active helmfile charts
#+begin_src bash :results pp :wrap src org :exports both
while read chartName; do
  chartFile="./helm/$chartName/Chart.yaml"
  echo "- $chartName$(test -f "$chartFile" && yq '" :: " + .description' <"$chartFile")"
done <<<$(yq '.releases | .[] | .name' ./helm/helmfile.yaml)
#+end_src

#+RESULTS:
#+begin_src org
- ingress-nginx
- nims-tofu-cloud :: Hello World HTTP server in Nim
#+end_src


* How to run
** Production
1. Add your Vultr PAT at =.env=
2. Run
   #+begin_src bash
   make ENV=prod tofu-init tofu-plan tofu-apply helmfile-apply
   #+end_src

** Local
1. Start ~minikube~
   #+begin_src bash
   minikube start --driver=docker
   #+end_src
2. Run
   #+begin_src bash
   make helmfile-apply
   #+end_src


* Makefile targets
#+begin_src bash :results pp :exports both
make help
#+end_src

#+RESULTS:
#+begin_example
Current configs:
  ENV: dev
  ENV_FILE: ./.env
  INFRA_DIR: ./clusters
  INFRA_PLAN_FILE: plan.tfplan
  INFRA_TFSTATE_DIR: ./clusters/tfstates
  TOFU: tofu -chdir=./clusters
  KUBECONFIG_DEV: /home/user/.kube/config
  HELM_DIR: ./helm
  HELM: helm
  HELMFILE_YAML: ./helm/helmfile.yaml
  HELMFILE: helmfile -f ./helm/helmfile.yaml
  KUBECTL: kubectl
Dynamically obtained values:
  KUBECONFIG_PROD: /home/user/Documents/repos/infra/clusters/.kubeconfig
  KUBECONFIG_EFFECTIVE: /home/user/.kube/config

Available targets:
  Tofu targets:
    tofu-init                Initialize infrastructure
    tofu-plan                Plan infrastructure changes
    tofu-apply               Apply infrastructure changes
    tofu-refresh             Refresh infrastructure state
  Helm/helmfile targets:
    helmfile-apply           Runs apply command with kubeconfig set
    helmfile-diff            Runs diff helmfile command
    helmfile-destroy         Runs destroy helmfile command
    helmfile-sync            Runs sync helmfile command
    helmfile-test            Tests all charts
  KubeCTL targets:
    kubectl-ingress-url      Gets the public URL of ingress
  Other targets:
    clean                    Clean up generated files
#+end_example
